package main

import (
	"fmt"
	//"strings"
	"testing"
)

func TestSim(t *testing.T) {
	var testsuite = []struct {
		common string
		dict   string
	}{
		{"глиатилин 400 мг капс № 90", "ГЛИАТИЛИН КАПС. 400 МГ"},
		{"глиатилин амп 4 мл № 9", "ГЛИАТИЛИН КАПС. 400 МГ"},
		{"глиатилин кап. 0,4", "ГЛИАТИЛИН КАПС. 400 МГ"},
		{"мильгамма 2,0 амп.", "ТИОГАММА ТАБ 600 МГ"},
		{"Алфлутоп амп.1,0", "ДЕКСАЛГИН  АМП 2,0"},
		{"Глиатилин кап. 400 мг. на курс №14кап, 2 раза в год", "ГЛИАТИЛИН КАПС. 400 МГ"},
		{"Цераксон амп 4.0 №10", "НЕЙРОКС АМП 2 МЛ"},
		{"Актовегин 5,0 амп.", "ПРОЗЕРИН АМП"},
		{"Мексидол 0,125 таб", "МЕКСИДОЛ АМП 5 МЛ"},
		{"Мексидол 0,125 таб", "МЕКСИДОЛ ТАБ 125МГ"},
		{"Галидор амп 2.0 №10", "МЕКСИДОЛ АМП 2 МЛ"},
		{"Комбилипен амп 2.0 №10", "ОКТОЛИПЕН КАП 300 МГ"},
		{"Ксефокам рапид таб 8 мг №24", "ВЕРАПАМИЛ ТАБ 80 МГ"},
		{"Нейромидин таб 20 мг №100", "ВИНПОЦЕТИН ТАБ 10 МГ"},
		{"Нейромидин таб 20 мг №100", "НЕЙРОКС АМП 2 МЛ"},
		{"", ""},
		{"", ""},
		{"", ""},
	}
	for _, tst := range testsuite {
		v1 := similarity(tst.common, tst.dict)
		v2 := similarity2(tst.dict, tst.common)
		fmt.Printf("%.3f\t%.3f\t%s == %s\n", v1, v2, tst.common, tst.dict)
	}
}
